tap "beeftornado/rmtree"
tap "buo/cask-upgrade"
tap "clojure-lsp/brew"
tap "d12frosted/emacs-plus"
tap "daipeihust/tap"
tap "equalsraf/neovim-qt"
tap "hanleylee/old-versions", "git@github.com:hanleylee/homebrew-old-versions.git"
tap "he3-app/he3"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "laishulu/macism"
tap "leoafarias/fvm"
tap "mongodb/brew"
tap "peripheryapp/periphery"
tap "railwaycat/emacsmacport"
tap "universal-ctags/universal-ctags"
tap "zegervdv/zathura"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU database manager
brew "gdbm"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# Portable Foreign Function Interface library
brew "libffi"
# Manage compile and link flags for libraries
brew "pkg-config"
# X.Org: pthread-stubs.pc
brew "libpthread-stubs"
# X.Org: Protocol Headers
brew "xorgproto"
# X.Org: A Sample Authorization Protocol for X
brew "libxau"
# X.Org: X Display Manager Control Protocol library
brew "libxdmcp"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# X.Org: Core X11 protocol client library
brew "libx11"
# X.Org: Library for common extensions to the X11 protocol
brew "libxext"
# X.Org: Library for the Render Extension to the X11 protocol
brew "libxrender"
# Real-time data compression library
brew "lzo"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# Perl compatible regular expressions library
brew "pcre"
# Low-level library for pixel manipulation
brew "pixman"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Vector graphics library with cross-device output support
brew "cairo"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# TIFF library and utilities
brew "libtiff"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# OpenType text shaping engine
brew "harfbuzz"
# Extremely Fast Compression algorithm
brew "lz4"
# Framework for layout and rendering of i18n text
brew "pango"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Strip or convert ANSI codes into HTML, (La)Tex, RTF, or BBCode
brew "ansifilter"
# Library and utilities for processing GIFs
brew "giflib"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Development kit for the Java programming language
brew "openjdk"
# Java build tool
brew "ant"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# High dynamic-range image file format
brew "openexr", link: false
# Image format providing lossless and lossy compression for web images
brew "webp"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Apache Portable Runtime library
brew "apr"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# C library implementing the SSH2 protocol
brew "libssh2"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Portable library for importing many well-known 3D model formats
brew "assimp"
# Linter and formatter to improve copywriting, correct spaces, words between CJK
brew "autocorrect"
# Shell extension to jump to frequently used directories
brew "autojump"
# Automatically formats Python code to conform to the PEP 8 style guide
brew "autopep8"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# TAP-compliant test framework for Bash scripts
brew "bats"
# Cross platform file encryption utility using blowfish
brew "bcrypt"
# Garbage collector for C and C++
brew "bdw-gc"
# Double-entry accounting tool that works on plain text files
brew "beancount", link: false
# High performance key/value database
brew "berkeley-db"
# Collection of portable C++ source libraries
brew "boost"
# New way to see and navigate directory trees
brew "broot"
# Freely available high-quality data compressor
brew "bzip2"
# Asynchronous DNS library
brew "c-ares"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Decentralized dependency manager for Cocoa
brew "carthage"
# C string library for manipulating Unicode strings
brew "libunistring"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Asynchronous event library
brew "libevent"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# Emacs dependency management
brew "cask"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# C++ template library for linear algebra
brew "eigen"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for multiple-precision floating-point computations
brew "mpfr"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# Library for processing command-line flags
brew "gflags"
# Application-level logging library
brew "glog"
# Programs that partition graphs and order matrices
brew "metis"
# Optimized BLAS library
brew "openblas"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# Rich and complete approach to parallelism in C++
brew "tbb"
# C++ library for large-scale optimization
brew "ceres-solver"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Python 2 and 3 compatibility utilities
brew "six"
# Distributed, open source, package manager for C/C++
brew "conan"
# Tool for browsing source code
brew "cscope"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# POSIX-compliant descendant of NetBSD's ash (the Almquist SHell)
brew "dash", link: false
# AV1 decoder targeted to be small and fast
brew "dav1d"
# Message bus system, providing inter-application communication
brew "dbus"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Diff that understands syntax
brew "difftastic"
# Standard SGML representation system for technical documents
brew "docbook"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Text processing system for reStructuredText
brew "docutils"
# Binary-decimal and decimal-binary routines for IEEE doubles
brew "double-conversion"
# Generate documentation for several programming languages
brew "doxygen"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Apply a diff file to an original
brew "gpatch"
# Highly capable, feature-rich programming language
brew "perl"
# Debian package management system
brew "dpkg"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# General purpose Language Server
brew "efm-langserver"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Platform built on V8 to build network applications
brew "node"
# AST-based pattern checker for JavaScript
brew "eslint"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# EXIF and IPTC metadata manipulation library and tools
brew "exiv2"
# Easiest way to build and release mobile apps
brew "fastlane"
# Web interface for the double-entry bookkeeping software Beancount
brew "fava"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Ogg Bitstream Library
brew "libogg"
# Free lossless audio codec
brew "flac"
# Minimalistic plugin API for video effects
brew "frei0r"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Image manipulation library
brew "jpeg"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Secure hashing function
brew "libb2"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Library for sample rate conversion of audio data
brew "libsamplerate"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# Audio codec
brew "opus"
# C library for files containing sampled sound
brew "libsndfile"
# NaCl networking and cryptography library
brew "libsodium"
# High quality, one-dimensional sample-rate conversion library
brew "libsoxr"
# Transcode video stabilization plugin
brew "libvidstab"
# VP8/VP9 video codec
brew "libvpx"
# Audio codecs extracted from Android open source project
brew "opencore-amr"
# Fastest and safest AV1 video encoder
brew "rav1e"
# Audio time stretcher tool and library
brew "rubberband"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Compression/decompression library aiming for high speed
brew "snappy"
# Audio codec designed for speech
brew "speex"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Open video compression format
brew "theora"
# H.264/AVC encoder
brew "x264"
# H.265/HEVC encoder
brew "x265"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# High-performance, asynchronous messaging library
brew "zeromq"
# Scaling, colorspace conversion, and dithering library
brew "zimg"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Graphics library to dynamically manipulate images
brew "gd"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# JBIG2 decoder and library (for monochrome documents)
brew "jbig2dec"
# International domain name library
brew "libidn"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# AVH edition of git-flow
brew "git-flow-avh"
# Git extension for versioning large files
brew "git-lfs"
# Open GitHub webpages from a terminal
brew "git-open"
# Update multiple git repositories at once
brew "gitup"
# OpenGL to PostScript printing library
brew "gl2ps"
# OpenGL Extension Wrangler Library
brew "glew"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Network related modules for glib
brew "glib-networking"
# Text-based UI library
brew "ncurses"
# Maintained ctags implementation
brew "universal-ctags"
# Source code tag system
brew "global"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Powerful, lightweight programming language
brew "lua"
# Cross-platform application and UI framework
brew "qt@5"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Language server for the Go language
brew "gopls"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image processing tools collection
brew "graphicsmagick"
# Image manipulation
brew "netpbm"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Popular GNU data compression program
brew "gzip"
# File format designed to store large amounts of data
brew "hdf5"
# CLI hex dumper with colors
brew "heksa"
# Command-line hex viewer
brew "hexyl"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP server
brew "httpd"
# Add GitHub support to git on the command-line
brew "hub"
# Command-line benchmarking tool
brew "hyperfine"
# Improved colored diff
brew "icdiff"
# Library for Apple Binary- and XML-Property Lists
brew "libplist"
# USB multiplexor library for iOS devices
brew "libusbmuxd"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# OpenEXR ILM Base libraries (high dynamic-range image file format)
brew "ilmbase"
# Open h.265 video codec implementation
brew "libde265"
# Convert XML to another format (based on XSL or other tools)
brew "xmlto"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# C/C++ seam carving library
brew "liblqr"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Sort Python imports automatically
brew "isort"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library for interacting with JSON
brew "jsoncpp"
# JSON parser and validator with a CLI
brew "jsonlint"
# Add indentation to LaTeX files
brew "latexindent"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# Input filter for the pager less
brew "lesspipe"
# Terminal file manager
brew "lf"
# Asynchronous event library
brew "libev"
# JIT library for the GNU compiler collection
brew "libgccjit"
# C library to parse Metalink XML files
brew "libmetalink"
# Library that sends desktop notifications to a notification daemon
brew "libnotify"
# HTTP client/server library for GNOME
brew "libsoup"
# Operating System information database
brew "libosinfo"
# Library that provides automatic proxy configuration management
brew "libproxy"
# Very basic terminfo library
brew "unibilium"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# GNOME XML library
brew "libxml2"
# XML security library
brew "libxmlsec1"
# X.Org: X miscellaneous utility routines library
brew "libxmu"
# Next-gen compiler infrastructure
brew "llvm"
# OpenResty's Branch of LuaJIT 2
brew "luajit-openresty"
# Package manager for the Lua programming language
brew "luarocks"
# Bare libuv bindings for lua
brew "luv"
# Swiss Army knife of email handling
brew "mailutils"
# Utility for directing compilation
brew "make"
# Unix documentation system
brew "man-db"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson"
# Terminal-based visual file manager
brew "midnight-commander"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Platform built on V8 to build network applications
brew "node@16"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Pretty-print tabular data in Python
brew "python-tabulate"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Open source relational database management system
brew "mysql"
# Node version management
brew "n"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Get, set, and list display resolution
brew "screenresolution"
# Fast, highly customisable system info script
brew "neofetch"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Platform built on V8 to build network applications
brew "node@14"
# Package for scientific computing with Python
brew "numpy"
# Package for scientific computing with Python
brew "numpy@1.16"
# Convert OpenDocument files to plain text
brew "odt2txt"
# OCaml package manager
brew "opam"
# C library to read whole-slide images (a.k.a. virtual slides)
brew "openslide"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Indents and reformats Perl scripts to make them easier to read
brew "perltidy"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Draw UML diagrams
brew "plantuml"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Static site generator for Swift developers
brew "publish"
# Light-weight C++ XML processing library
brew "pugixml"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Bundle a Python application and all its dependencies
brew "pyinstaller"
# It's not just a linter that annoys you!
brew "pylint"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Static type checker for Python
brew "pyright"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# QR Code generation
brew "qrencode"
# Software environment for statistical computing
brew "r"
# File browser
brew "ranger"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Bash completion for rustc
brew "rustc-completion"
# Rust toolchain installer
brew "rustup-init"
# Software for mathematics, science, and engineering
brew "scipy"
# StarDict Console Version
brew "sdcv"
# SDL2 graphics drawing primitives and other support functions
brew "sdl2_gfx"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Sample multi-channel audio mixer library
brew "sdl2_mixer"
# Small sample cross-platform networking library
brew "sdl2_net"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# Sample multi-channel audio mixer library
brew "sdl_mixer"
# Shell Script Compiler
brew "shc"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Simple keystroke visualizer
brew "showkey"
# Tool to create Python bindings for C and C++ libraries
brew "sip"
# SMART hard drive monitoring
brew "smartmontools"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# CLI utility for manipulating SQLite databases
brew "sqlite-utils"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Version control system designed to be a better CVS
brew "subversion"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Implementation of extended-Rice lossless compression algorithm
brew "szip", link: false
# Tools for market analysis
brew "ta-lib"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal image and video viewer
brew "timg"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Converts DOS <-> UNIX text files, alias tofromdos
brew "tofrodos"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Data compression library with small memory footprint
brew "ucl"
# Undo git commands. Your damage control git buddy
brew "ugit"
# UTF-8 with C++ in a Portable Way
brew "utf8cpp"
# Platform for building proxies to bypass network restrictions
brew "v2ray"
# Ncurses-based file manager with vi-like keybindings
brew "vifm"
# Use ViM as PAGER
brew "vimpager"
# Vim script Language Lint
brew "vint"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# VNC server for real X displays
brew "x11vnc"
# Access X11 clipboards from the command-line
brew "xclip"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# XML command-line utilities
brew "xmlstarlet"
# C++ YAML parser and emitter for YAML 1.2 spec
brew "yaml-cpp"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Modular BSD reimplementation of NASM
brew "yasm"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Debugger for zsh
brew "zshdb"
brew "beeftornado/rmtree/brew-rmtree"
# Language Server (LSP) for Clojure
brew "clojure-lsp/brew/clojure-lsp-native"
# Switch your input method through terminal
brew "daipeihust/tap/im-select"
# MacOS Input Source Manager
brew "laishulu/macism/macism"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
